# CannotFindHost Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..FamilyFailures..::..CannotFindHost Property
BuiltInFailures..::..FamilyFailures Class See Also
---
Couldn't find an appropriate Host. Try selecting a different Host Face or switch Placement Mode.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId CannotFindHost { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property CannotFindHost As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ CannotFindHost {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..FamilyFailures Class
Autodesk.Revit.DB Namespace